In [2]:
# Import the neccessary modules
import pandas as pd
from sqlalchemy import create_engine

In [9]:
# Connect to MySQL
mysql_engine = create_engine("mysql://root:*****@localhost:3306/mydatadb")

In [13]:
# Import data
data = pd.read_excel("D:/Google Data Analytics/Bootcamp/AlexTheAnalyst/Nashville_Housing_Data.xlsx")

In [14]:
# Load the imported file into database
data.to_sql('Nashville_Housing_Data', mysql_engine, if_exists='replace', index=False)

C:\Users\NC\AppData\Local\Temp\ipykernel_14960\57211119.py:2: UserWarning: The provided table name 'Nashville_Housing_Data' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  data.to_sql('Nashville_Housing_Data', mysql_engine, if_exists='replace', index=False)

56477

In [1]:
# Load SQL module

%load_ext sql

In [2]:
# Connect to the database

%sql mysql://root:****@localhost:3306/mydatadb

'Connected: root@mydatadb'

In [4]:
%%sql 

SELECT *
FROM Nashville_Housing_Data
LIMIT 5;

 * mysql://root:***@localhost:3306/mydatadb
5 rows affected.

[(2045, '007 00 0 125.00', 'SINGLE FAMILY', '1808  FOX CHASE DR, GOODLETTSVILLE', 240000, '20130412-0036474', 'No', 'FRAZIER, CYRENTHA LYNETTE', '1808  FOX CHASE DR, GOODLETTSVILLE, TN', 2.3, 'GENERAL SERVICES DISTRICT', 50000.0, 168200.0, 235700.0, 1986.0, 3.0, 3.0, 0.0, datetime.date(2013, 4, 9)),
 (16918, '007 00 0 130.00', 'SINGLE FAMILY', '1832  FOX CHASE DR, GOODLETTSVILLE', 366000, '20140619-0053768', 'No', 'BONER, CHARLES & LESLIE', '1832  FOX CHASE DR, GOODLETTSVILLE, TN', 3.5, 'GENERAL SERVICES DISTRICT', 50000.0, 264100.0, 319000.0, 1998.0, 3.0, 3.0, 2.0, datetime.date(2014, 6, 10)),
 (54582, '007 00 0 138.00', 'SINGLE FAMILY', '1864 FOX CHASE  DR, GOODLETTSVILLE', 435000, '20160927-0101718', 'No', 'WILSON, JAMES E. & JOANNE', '1864  FOX CHASE DR, GOODLETTSVILLE, TN', 2.9, 'GENERAL SERVICES DISTRICT', 50000.0, 216200.0, 298000.0, 1987.0, 4.0, 3.0, 0.0, datetime.date(2016, 9, 26)),
 (43070, '007 00 0 143.00', 'SINGLE FAMILY', '1853  FOX CHASE DR, GOODLETTSVILLE', 255000, '20160129-0008913', 'No', 'BAKER, JAY K. & SUSAN E.', '1853  FOX CHASE DR, GOODLETTSVILLE, TN', 2.6, 'GENERAL SERVICES DISTRICT', 50000.0, 147300.0, 197300.0, 1985.0, 3.0, 3.0, 0.0, datetime.date(2016, 1, 29)),
 (22714, '007 00 0 149.00', 'SINGLE FAMILY', '1829  FOX CHASE DR, GOODLETTSVILLE', 278000, '20141015-0095255', 'No', 'POST, CHRISTOPHER M. & SAMANTHA C.', '1829  FOX CHASE DR, GOODLETTSVILLE, TN', 2.0, 'GENERAL SERVICES DISTRICT', 50000.0, 152300.0, 202300.0, 1984.0, 4.0, 3.0, 0.0, datetime.date(2014, 10, 10))]

As we can see, the `SaleDate` has the DATETIME data type. We are gonna convert it to DATE type. Our main goal is to add another column and remove the `SaleDate` column

In [10]:
%%sql 

# Standardize Date Format

SELECT SaleDate, CONVERT(SaleDate, DATE)
FROM Nashville_Housing_Data
LIMIT 5;

 * mysql://root:***@localhost:3306/mydatadb
5 rows affected.

[(datetime.datetime(2013, 4, 9, 0, 0), datetime.date(2013, 4, 9)),
 (datetime.datetime(2014, 6, 10, 0, 0), datetime.date(2014, 6, 10)),
 (datetime.datetime(2016, 9, 26, 0, 0), datetime.date(2016, 9, 26)),
 (datetime.datetime(2016, 1, 29, 0, 0), datetime.date(2016, 1, 29)),
 (datetime.datetime(2014, 10, 10, 0, 0), datetime.date(2014, 10, 10))]

Let's add another column name `sale_date` and set the converted value into the new `sale_date` column

In [13]:
%%sql

ALTER TABLE Nashville_Housing_Data
ADD sale_date DATE;

 * mysql://root:***@localhost:3306/mydatadb
0 rows affected.

[]

In [14]:
%%sql

UPDATE Nashville_Housing_Data
SET sale_date = CONVERT(SaleDate, DATE);

 * mysql://root:***@localhost:3306/mydatadb
56477 rows affected.

[]

In [15]:
%%sql

SELECT sale_date
FROM Nashville_Housing_Data
LIMIT 2;

 * mysql://root:***@localhost:3306/mydatadb
2 rows affected.

[(datetime.date(2013, 4, 9),), (datetime.date(2014, 6, 10),)]

In [16]:
%%sql 

ALTER TABLE Nashville_Housing_Data
DROP COLUMN SaleDate;

 * mysql://root:***@localhost:3306/mydatadb
0 rows affected.

[]

In [18]:
%%sql 

SELECT *
FROM Nashville_Housing_Data
LIMIT 2

 * mysql://root:***@localhost:3306/mydatadb
2 rows affected.

[(2045, '007 00 0 125.00', 'SINGLE FAMILY', '1808  FOX CHASE DR, GOODLETTSVILLE', 240000, '20130412-0036474', 'No', 'FRAZIER, CYRENTHA LYNETTE', '1808  FOX CHASE DR, GOODLETTSVILLE, TN', 2.3, 'GENERAL SERVICES DISTRICT', 50000.0, 168200.0, 235700.0, 1986.0, 3.0, 3.0, 0.0, datetime.date(2013, 4, 9)),
 (16918, '007 00 0 130.00', 'SINGLE FAMILY', '1832  FOX CHASE DR, GOODLETTSVILLE', 366000, '20140619-0053768', 'No', 'BONER, CHARLES & LESLIE', '1832  FOX CHASE DR, GOODLETTSVILLE, TN', 3.5, 'GENERAL SERVICES DISTRICT', 50000.0, 264100.0, 319000.0, 1998.0, 3.0, 3.0, 2.0, datetime.date(2014, 6, 10))]

Populate `PropertyAddress` data(Dealing with NULL)

In [4]:
%%sql


SELECT *
FROM Nashville_Housing_Data
WHERE PropertyAddress IS NULL
LIMIT 5;

 * mysql://root:***@localhost:3306/mydatadb
5 rows affected.

[(43076, '025 07 0 031.00', 'SINGLE FAMILY', None, 179900, '20160120-0005776', 'No', 'COSTNER, FRED & CAROLYN', '410  ROSEHILL CT, GOODLETTSVILLE, TN', 0.96, 'CITY OF GOODLETTSVILLE', 30000.0, 70000.0, 100000.0, 1964.0, 3.0, 1.0, 0.0, datetime.date(2016, 1, 15)),
 (39432, '026 01 0 069.00', 'VACANT RESIDENTIAL LAND', None, 153000, '20151028-0109602', 'No', 'SHACKLEFORD, MICHAEL C., JR.', '141  TWO MILE PIKE, GOODLETTSVILLE, TN', 0.17, 'CITY OF GOODLETTSVILLE', 21100.0, 121600.0, 142700.0, 2015.0, 3.0, 2.0, 0.0, datetime.date(2015, 10, 23)),
 (45290, '026 05 0 017.00', 'SINGLE FAMILY', None, 155000, '20160330-0029941', 'No', 'TRIPP, MARVIN S. & DEBORAH YOUNG', '208  EAST AVE, GOODLETTSVILLE, TN', 0.2, 'CITY OF GOODLETTSVILLE', 21100.0, 130200.0, 151300.0, 2008.0, 3.0, 2.0, 0.0, datetime.date(2016, 3, 29)),
 (53147, '026 06 0A 038.00', 'RESIDENTIAL CONDO', None, 144900, '20160831-0091567', 'No', None, None, None, None, None, None, None, None, None, None, None, datetime.date(2016, 8, 25)),
 (43080, '033 06 0 041.00', 'SINGLE FAMILY', None, 170000, '20160107-0001526', 'No', 'FRANK, ZACHARY & NIKI', '1129  CAMPBELL RD, GOODLETTSVILLE, TN', 0.24, 'GENERAL SERVICES DISTRICT', 35000.0, 110500.0, 145500.0, 2000.0, 3.0, 2.0, 0.0, datetime.date(2016, 1, 4))]

Now, We'll populate all null values from `PrpertyAddress` into a real address. When we searched for `PropertyAddress` we identifed a pattern in `ParcelID` column. Which is we see some duplicates in `ParcelID`. And except the `UniqueID` field other fields are same. Lets have a look:

In [26]:
%%sql


SELECT ParcelID, PropertyAddress, COUNT(ParcelID) 
FROM Nashville_Housing_Data
GROUP BY ParcelID, PropertyAddress
ORDER BY COUNT(ParcelID) DESC
LIMIT 5;

 * mysql://root:***@localhost:3306/mydatadb
5 rows affected.

[('181 10 0A 281.00', '7823  OAKFIELD GRV, BRENTWOOD', 4),
 ('181 10 0E 016.00', '5123  ANDER DR, BRENTWOOD', 4),
 ('164 10 0A 243.00', '4265  SANDSTONE DR, ANTIOCH', 4),
 ('163 02 0B 034.00', '149  TOOK DR, ANTIOCH', 4),
 ('163 02 0B 080.00', '268  TOOK DR, ANTIOCH', 4)]

Now we are going to use **SELF JOIN** with `ParcelID` where `ParcelID` are same and `UniqueID` are not same. And for a clear picture of what we are going to do we will use a **WHERE** Statement to see all null values of `PropertyAddress` from n1 table.

In [30]:
%%sql

SELECT n1.ParcelID, n1.PropertyAddress, n2.ParcelID, n2.PropertyAddress
FROM Nashville_Housing_Data n1
JOIN Nashville_Housing_Data n2
    ON n1.ParcelID = n2.ParcelID 
    AND 
    n1.UniqueID <> n2.UniqueID
WHERE n1.PropertyAddress is null
LIMIT 5;

 * mysql://root:***@localhost:3306/mydatadb
5 rows affected.

[('025 07 0 031.00', None, '025 07 0 031.00', '410  ROSEHILL CT, GOODLETTSVILLE'),
 ('026 01 0 069.00', None, '026 01 0 069.00', '141  TWO MILE PIKE, GOODLETTSVILLE'),
 ('026 05 0 017.00', None, '026 05 0 017.00', '208  EAST AVE, GOODLETTSVILLE'),
 ('026 06 0A 038.00', None, '026 06 0A 038.00', '109  CANTON CT, GOODLETTSVILLE'),
 ('033 06 0 041.00', None, '033 06 0 041.00', '1129  CAMPBELL RD, GOODLETTSVILLE')]

At the left table we got null and for the same `ParcelID` we got a `PropertyAddress` in the right table. Now we can use `IFNULL()` function to replace nulls into a address. We'll now run the above query with an addition of `IFNULL()` function.

In [3]:
%%sql

SELECT n1.ParcelID, n1.PropertyAddress, n2.ParcelID, n2.PropertyAddress, IFNULL(n1.PropertyAddress, n2.PropertyAddress)
FROM Nashville_Housing_Data n1
JOIN Nashville_Housing_Data n2
    ON n1.ParcelID = n2.ParcelID 
    AND 
    n1.UniqueID <> n2.UniqueID
WHERE n1.PropertyAddress is null
LIMIT 5;

 * mysql://root:***@localhost:3306/mydatadb
5 rows affected.

[('025 07 0 031.00', None, '025 07 0 031.00', '410  ROSEHILL CT, GOODLETTSVILLE', '410  ROSEHILL CT, GOODLETTSVILLE'),
 ('026 01 0 069.00', None, '026 01 0 069.00', '141  TWO MILE PIKE, GOODLETTSVILLE', '141  TWO MILE PIKE, GOODLETTSVILLE'),
 ('026 05 0 017.00', None, '026 05 0 017.00', '208  EAST AVE, GOODLETTSVILLE', '208  EAST AVE, GOODLETTSVILLE'),
 ('026 06 0A 038.00', None, '026 06 0A 038.00', '109  CANTON CT, GOODLETTSVILLE', '109  CANTON CT, GOODLETTSVILLE'),
 ('033 06 0 041.00', None, '033 06 0 041.00', '1129  CAMPBELL RD, GOODLETTSVILLE', '1129  CAMPBELL RD, GOODLETTSVILLE')]

Before running the `Update` query we are going to create index which will help us to speed up the `JOIN` operation by allowing the database to quickly find the matching rows based on the indexed column.  Already ran the `Update` query without `CREATE INDEX` and we experienced a huge delay.

In [12]:
%%sql

CREATE INDEX idx_ParcelID ON Nashville_Housing_Data (ParcelID(20));

 * mysql://root:***@localhost:3306/mydatadb
0 rows affected.

[]

Now the `IFNULL` values will be passed in the `PropertyAddress` and replace all null values. IN this query we are going to use `INNER JOIN` instead of `SELF JOIN`

In [13]:
%%sql 

Update Nashville_Housing_Data n1
INNER JOIN Nashville_Housing_Data n2
    ON n1.ParcelID = n2.ParcelID 
    AND 
    n1.UniqueID <> n2.UniqueID
SET n1.PropertyAddress = IFNULL(n1.PropertyAddress, n2.PropertyAddress);

 * mysql://root:***@localhost:3306/mydatadb
15143 rows affected.

[]

In [14]:
%%sql

SELECT *
FROM Nashville_Housing_Data
WHERE PropertyAddress is null;

 * mysql://root:***@localhost:3306/mydatadb
0 rows affected.

[]

Breaking out `PropertyAddress` into Individual Columns (Address, City, State)

In [19]:
%%sql

SELECT PropertyAddress
FROM Nashville_Housing_Data
LIMIT 2;

 * mysql://root:***@localhost:3306/mydatadb
2 rows affected.

[('1808  FOX CHASE DR, GOODLETTSVILLE',),
 ('1832  FOX CHASE DR, GOODLETTSVILLE',)]

Creating columns to store address and city

In [20]:
%%sql

ALTER TABLE Nashville_Housing_Data
ADD property_address nvarchar(255);

 * mysql://root:***@localhost:3306/mydatadb
0 rows affected.

[]

In [21]:
%%sql

ALTER TABLE Nashville_Housing_Data
ADD property_city nvarchar(255);

 * mysql://root:***@localhost:3306/mydatadb
0 rows affected.

[]

In [25]:
%%sql 

SELECT SUBSTRING(PropertyAddress, 1, LOCATE(',', PropertyAddress)-1) Address, 
        SUBSTRING(PropertyAddress, LOCATE(',', PropertyAddress)+1, CHAR_LENGTH(PropertyAddress)) City
FROM Nashville_Housing_Data
LIMIT 5;

 * mysql://root:***@localhost:3306/mydatadb
5 rows affected.

[('1808  FOX CHASE DR', ' GOODLETTSVILLE'),
 ('1832  FOX CHASE DR', ' GOODLETTSVILLE'),
 ('1864 FOX CHASE  DR', ' GOODLETTSVILLE'),
 ('1853  FOX CHASE DR', ' GOODLETTSVILLE'),
 ('1829  FOX CHASE DR', ' GOODLETTSVILLE')]

In [28]:
%%sql

UPDATE Nashville_Housing_Data
SET property_address = SUBSTRING(PropertyAddress, 1, LOCATE(',', PropertyAddress)-1);

 * mysql://root:***@localhost:3306/mydatadb
56477 rows affected.

[]

In [29]:
%%sql

UPDATE Nashville_Housing_Data
SET property_city = SUBSTRING(PropertyAddress, LOCATE(',', PropertyAddress)+1, CHAR_LENGTH(PropertyAddress));

 * mysql://root:***@localhost:3306/mydatadb
56477 rows affected.

[]

In [30]:
%%sql

SELECT *
FROM Nashville_Housing_Data
LIMIT 2;

 * mysql://root:***@localhost:3306/mydatadb
2 rows affected.

[(2045, '007 00 0 125.00', 'SINGLE FAMILY', '1808  FOX CHASE DR, GOODLETTSVILLE', 240000, '20130412-0036474', 'No', 'FRAZIER, CYRENTHA LYNETTE', '1808  FOX CHASE DR, GOODLETTSVILLE, TN', 2.3, 'GENERAL SERVICES DISTRICT', 50000.0, 168200.0, 235700.0, 1986.0, 3.0, 3.0, 0.0, datetime.date(2013, 4, 9), '1808  FOX CHASE DR', ' GOODLETTSVILLE'),
 (16918, '007 00 0 130.00', 'SINGLE FAMILY', '1832  FOX CHASE DR, GOODLETTSVILLE', 366000, '20140619-0053768', 'No', 'BONER, CHARLES & LESLIE', '1832  FOX CHASE DR, GOODLETTSVILLE, TN', 3.5, 'GENERAL SERVICES DISTRICT', 50000.0, 264100.0, 319000.0, 1998.0, 3.0, 3.0, 2.0, datetime.date(2014, 6, 10), '1832  FOX CHASE DR', ' GOODLETTSVILLE')]

Split address, city, state from `OwnerAddress`

In [6]:
%%sql 

SELECT OwnerAddress
FROM Nashville_Housing_Data
LIMIT 5;

 * mysql://root:***@localhost:3306/mydatadb
5 rows affected.

[('1808  FOX CHASE DR, GOODLETTSVILLE, TN',),
 ('1832  FOX CHASE DR, GOODLETTSVILLE, TN',),
 ('1864  FOX CHASE DR, GOODLETTSVILLE, TN',),
 ('1853  FOX CHASE DR, GOODLETTSVILLE, TN',),
 ('1829  FOX CHASE DR, GOODLETTSVILLE, TN',)]

Now, If we look at the `SoldAsVacant` field we see that it has YES, NO, Y & N. We will change Y and N to Yes and No in "Sold as Vacant" field

In [4]:
%%sql

SELECT DISTINCT SoldAsVacant, COUNT(SoldAsVacant)
FROM Nashville_Housing_Data
GROUP BY SoldAsVacant
ORDER BY 2
LIMIT 5;

 * mysql://root:***@localhost:3306/mydatadb
4 rows affected.

[('Y', 52), ('N', 399), ('Yes', 4623), ('No', 51403)]

In [6]:
%%sql

UPDATE Nashville_Housing_Data
SET SoldAsVacant = CASE WHEN SoldAsVacant = 'Y' THEN 'YES'
                        WHEN SoldAsVacant = 'N' THEN 'NO'
                        ELSE SoldAsVacant END;

 * mysql://root:***@localhost:3306/mydatadb
56477 rows affected.

[]

In [8]:
%%sql

SELECT DISTINCT SoldAsVacant, COUNT(SoldAsVacant)
FROM Nashville_Housing_Data
GROUP BY SoldAsVacant
ORDER BY 2;

 * mysql://root:***@localhost:3306/mydatadb
2 rows affected.

[('Yes', 4675), ('No', 51802)]